;Localization:
;Thank you very much translators for your time to help me improve Listary!
;You’ll get one Listary Pro license for free if you help translate this file into your language.
;Contact support@listary.com for more information.

;Copy English.ini to YourLanguage.ini

[Info]
;Language name in your own language e.g. Deutsch
Language=Slovenský
;Language name in English e.g. German
LanguageEn=Slovak
;Your name here. You can also leave your email, website, blog...
Translator=JaA
;Version of this language file
Version=1.0.0
;If you don't know, leave it blank
Codepage=

;Note to translators:
;Please keep escape sequences like \n, \t, %d, %s, %% unchanged
[Strings]
;Global
601=Žiadny
602=Listary nastavenia

;Tray Menu
1001=Online manuál
1002=Skontroluj aktualizácie...
1003=O programe
1004=Koniec

;Toolbar
1100=Hľadaj

;Favorite Menu
2000=Obľúbené
2001=Tento program
2002=Globálne
2003=Pridaj tu
2004=Pridaj aktuálny adresár k obľúbeným
2050=Pridanie k obľúbeným sa nepodarilo
2051=Listary nemohol získať cestu z tohto programu.

;Recent Menu
2100=Posledné
2101=Zmaž
2103=Adresár
2104=Súbor
2105=Sledovať tento program
2106=Nesledovať tento program
2107=Zobraz viac...

;Smart Menu
2200=Inteligentný
2201=Aktuálne otvorené adresáre
2202=Prepni na posledný otvorený adresár v Správcovi súborov
2203=Otvor zvolený súbor v Správcovi súborov
2204=Preskúmať aktuálny adresár
2205=Príkazový riadok
2206=Prejdi do adresára programu
2207=Preskúmať adresár programu
2208=Zobraz prípony súborov
2209=Zobraz skryté súbory a adresáre
2210=Skopíruj cestu k adresáru do schránky
2211=Skopíruj cesty vybraných položiek do schránky
2212=Skopíruj zobrazené názvy vybraných položiek do schránky
2213=Nastavenie
2214=Aktualizuj na verziu Pro
2215=Pridaj program k zoznamu podporovaných
2216=Zakáž Listary pre tento program
2217=Exportuj obsah zoznamu do CSV súboru
2218=Oddeľovač
2250=%s bol úspešne pridaný do zoznamu podporovaných.
2251=Môžete teraz kliknutím stredného tlačidla  alebo klávesovú skratku %s k aktivácii Listary v %s.
2252=Učite chcete zakázať Listary pre tento program?
2253=Zakázať Listary
2254=Listary sa pri ďalšom spustení tohto programu nezobrazí.\nMôžete to zmeniť v menu Nastavenie > Programy znovu povoliť.

;Search
2300=Zoznam
2301=Prejsť
2302=Žiadna položka neodpovedá hľadanej.

;Options > General
3000=Hlavné
3001=Spustiť Listary pri štarte Windows
3002=Automaticky nastaviť fókus na zoznam súborov pre prieskumníka vo Windows XP
3003=Skontroluj aktualizácie pri otvorení Nastavenia
3004=Rýchle prepnutie (otvor aktuálny adresár v dialógovom okne po prepnutí zo správcu súborov)
3005=Jazyk:
3006=Východzí správca súborov
3007=Vyplňte pole, ak používate iný prednastavený program pre správu súborov ako prieskumníka Windows.\nPoužite %1 ako parameter pre cestu. Nezabudnite úvodzovky.


;Options > Favorites
3100=Obľúbené
3101=Podrobnosti
3102=Názov:
3103=Klávesová skratka:
3104=Typ:
3105=Cesta:
3106=Pod menu
3107=Pridaj obľúbenú položku
3108=Zmaž označenú obľúbenú položku

;Options > Recent
3200=Posledná
3201=Globálne posledné položky:
3206=Sleduj globálne posledné položky
3207=Sleduj posledné súbory a adresáre pre všetky programy
3208=Automaticky vyber posledný otvorené súbor v dialógu pre otvorenie súboru
3209=Zmaž označené posledné položky
3210=Odstráň všetky posledné položky
3211=Globálne posledné položky
3212=Posledné adresáre pre program
3213=Posledné súbory pre program
3214=Posledné položky v menu
3215=Hľadaj posledné súbory a adresáre

;Options > Smart Commands
3300=Inteligentné príkazy
3301=Podrobnosti príkazu
3303=Príkaz:
3305=Zobraz tento príkaz v inteligentnom menu
3306=Pridaj užívateľský príkaz
3307=Názov
3308=Klávesová skratka
3309=Príkaz
3310=Zobraz v inteligentnom menu
3311=Pridaj pripravený inteligentný príkaz
3312=Zmaž označený príkaz

;Options > Applications
3400=Programy
3401=Nastavenie programu: (ovplyvní len zvolený program z zozname nad)
3402=Povoliť Listary pre tento program
3403=Sleduj posledné súbory a adresáre
3404=Pridaj program pre zmenu jeho nastavení
3405=Zmaž zvolený program spolu s jeho obľúbenými a poslednými položkami
3406=Cesta

;Options > Keyboard and Mouse
3500=Klávesnica a myš
3501=Klávesové skratky
3502=Globálne:
3503=Zobraz lištu Listary:
3504=Zobraz kontextové menu:
3505=Lokálne (funguje len pri zobrazenej lište Listary):
3506=Menu obľúbené:
3507=Meu posledné:
3508=Menu inteligentné:
3509=Povoliť lokálne klávesové skratky (vrátane klávesových skratiek pre obľúbené a inteligentné príkazy) pre Explorer, keď lišta Listary je ukrytá.
3510=Myš
3511=Dvoj klikom na prázdne miesto aktivujete Listary v Exploreri/Dialógu súboru/Ploche
3512=Kliknite stredným tlačidlom pre aktiváciu Listary

;Options > Display
3600=Obrazovka
3601=Pozícia okna
3602=Absolútna
3603=Relatívne k zoznamu
3604=Relatívne k oknu
3605=Od hora
3606=Od dola
3607=Od ľava
3608=Od prava
3609=Priehľadnosť
3610=Menu
3611=Maximálny počet zobrazených položiek:
3612=Maximálna šírka (v bodoch):
3613=Minimálna šírka (v bodoch):
3614=Myš je nad a k otvoreniu menu nastane (oneskorenie v milisekundách, 0 zakázané):
3615=Kontextové menu
3616=Zobraz posledné položky v pod menu
3617=bodov

;Options > Integration
4000=Integrácia
4001=Pridaj menu adresár Total Commandera k obľúbeným do Listary
4002=Použi Total Commander ako náhradu za dialógy súboru:

;Options > Compatibility
3700=Kompatibilita
3701=Listary bude tiež pracovať s nasledovnými programami:
3702=Pridaj program do zoznamu podporovaných
3703=Zmaž označený program zo zoznamu podporovaných
3704=Správca súborov
3705=Trieda
3706=Spustiteľný
3707=Adresná lišta
3708=Áno
3709=Nie

;Options > Pro
3800=Prejdite na Listary Pro
;3801=
3802=Meno:
3803=E-mail:
3804=Registračné číslo:
3805=Poznámka
3806=Listary je poskytovaný ako bezplatný software pre osobné a neziskové používanie. V týchto prípadoch máte dovolené používať tento program bezplatne.
3807=Pre komerčné používanie potrebujete aktualizáciu na verziu Listary Pro.
3808=Vložiť zo schránky
3809=Skontroluj registračný kód

;Options > About
3900=O programe
3901=Listary je zdarma len pre osobné účely. Ak ho chcete používať pre komerčné účely alebo potrebujete niektoré pokročilejšie funkcie prosím zakúpte si verziu Pro.
3902=Zobraziť domovskú stránku
3903=Tento program je licencovaný pre

;Add Application Dialog
4100=Pridanie programu
4101=Ťahajte hľadáčik nad adresnú lištu programu k jeho výberu a potom uvoľníte tlačidlo myši.
4102=Hľadáčik:
4103=Trieda:
4104=Vykonateľný súbor:
4105=Adresná lišta:
4106=Je súbor správca (označte pre povolenie rozšírení, ktoré fungujú len v správcovi súborov)
4107=*ZLYHANIE* Beží cieľový program pod Admin právami?

;Custom Command Dialog
4200=Užívateľský príkaz
4201=Úplná cesta k vykonateľnému súboru.\nPríklad: C:\Program Files\7-Zip\7z.exe
4202=Parametre:
4203=Príklad ukazuje ako pridať zvolený súbor do archívu s použitím 7-Zip.\n\nMôžete použiť nasledovné premenné ako parameter. Premenné neobsahujú úvodzovky, prosím pridajte ich manuálne podľa potreby.
4204=%file%\t\tÚplná cesta k zvolenému súboru/adresáru.\nPríklad:  D:\download\music\example.mp3\n\n%path%\tCesta aktuálneho adresára.\nPríklad: D:\download\music\\n\n%filename%\tNázov súboru zvoleného súboru/adresára.\nPríklad: example.mp3

;Add Favorite Dialog
4300=Pridať k obľúbeným